/*
 * (C) Copyright 2003
 * Kyle Harris, Nexus Technologies, Inc. kharris@nexus-tech.net
 *
 * See file CREDITS for list of people who contributed to this
 * project.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License as
 * published by the Free Software Foundation; either version 2 of
 * the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place, Suite 330, Boston,
 * MA 02111-1307 USA
 */
//#define MMC_DEBUG
//#define DEBUG 1
#include <config.h>
#include <common.h>
#include <mmc.h>
#include <asm/errno.h>
#include <asm/arch/hardware.h>
#include <part.h>
#include <command.h>
#define MMC_BLOCK_SHIFT			9
#define MMC_BLOCK_SIZE			(1<<MMC_BLOCK_SHIFT)

#ifdef CONFIG_MMC

#ifdef CONFIG_IMX31
#include "mx31_pins.h"
#include "iomux.h"
void gpio_sdhc_active(int module)
{
	if (module==0) {
		mxc_request_iomux(MX31_PIN_SD1_CLK, OUTPUTCONFIG_FUNC,INPUTCONFIG_FUNC);
		mxc_request_iomux(MX31_PIN_SD1_CMD, OUTPUTCONFIG_FUNC,INPUTCONFIG_FUNC);

						while( (MMC_I_REG & MMC_I_REG_RXFIFO_RD_REQ) == 0 ) { }
#ifdef CONFIG_PXA27X
	   					pDst[0] = *((unsigned int volatile *)rxFIFO);
	   					pDst[1] = *((unsigned int volatile *)rxFIFO);
						pDst[2] = *((unsigned int volatile *)rxFIFO);
						pDst[3] = *((unsigned int volatile *)rxFIFO);

						pDst[4] = *((unsigned int volatile *)rxFIFO);
						pDst[5] = *((unsigned int volatile *)rxFIFO);
						pDst[6] = *((unsigned int volatile *)rxFIFO);
						pDst[7] = *((unsigned int volatile *)rxFIFO);
						pDst += 8;
#else
						{
							unsigned int val;
							int bytes = 32;
							while (bytes) {
								// read in the byte from the FIFO
								val = *rxFIFO;
								val |= (*rxFIFO << 8);
								val |= (*rxFIFO << 16);
								val |= (*rxFIFO << 24);
								*pDst++ = val;
								bytes-=4;
							}
						}
#endif
					}
				} // for each block
			}
			MMC_I_MASK = ~MMC_I_MASK_DATA_TRAN_DONE;	//only enable DATA_TRAN_DONE interrupt
			while (!(MMC_I_REG & MMC_I_REG_DATA_TRAN_DONE));
#endif
			status = MMC_STAT;
			if (status & MMC_STAT_ERRORS) {
				printf("MMC_STAT error %lx\n", status);
				return -1;
			}
//			printf( "completed mread... now stop\n" );

			mmc_cmd( MMC_CMD_STOP, 0, MMC_CMDAT_R1);

		} // multi-block read
	} // or why bother?
	return blkcnt;
}

static void dumpResponse( uchar *resp, unsigned bytes )
{
   debug( "rsp: " );
   if( resp )
   {
      while( bytes-- )
         debug( "%02X ", *resp++ );
      debug( "\n" );
   }
   else
      debug( "NULL\n" );
}
unsigned char* mmc_reset()
{
	unsigned char *resp;
	int i=0;
	do {
		resp = mmc_cmd(0, 0, MMC_CMDAT_INIT|0);	//reset
		if (resp) break;
		printf( "mmc_reset error\n" );
		i++;
		if (i>=10) break;
	} while (1);
	udelay(50);
	f4BitMode = 0;
	bHighCapacity = 0;
	return resp;
}

int SDCard_test( void )
{
	unsigned char *resp ;
	int highCapacityAllowed = 0;
	int cmdatInit = MMC_CMDAT_INIT;
	int bRetry=0;
	resp = mmc_reset();
	resp = mmc_cmd(8, (1<<8)|0xaa, cmdatInit|MMC_CMDAT_R1);	//request 2.7-3.6 volts, r7 is same length as r1
	if (resp) {
		highCapacityAllowed = 1<<30;
	}

	do {
		resp = mmc_cmd(SD_APP_CMD55, 0, cmdatInit|MMC_CMDAT_R1);
		if( !resp ) {
			resp = mmc_reset();
			resp = mmc_cmd(SD_APP_CMD55, 0, cmdatInit|MMC_CMDAT_R1);
			if (!resp ) {
				if (!bRetry) {
					printf( "SDInitErr1\n" );
					return -ENODEV ;
				}
			}
		}
		
		if (resp) {
			//bit 21 means 3.3 to 3.4 Volts
			resp = mmc_cmd(SD_APP_CMD41, (1<<21)|highCapacityAllowed, cmdatInit|MMC_CMDAT_R3);
			if ( !resp ) {
				if (!bRetry) {
					printf( "SDInitErr2\n" );
					return -ENODEV ;
				}
			} else {
				if ((resp[5] == 0x3f) && ( (resp[4]&0xbf) == 0x80)) break;
				cmdatInit = 0;
			}
		}
		bRetry++;
		udelay(1000);
		if (bRetry > 1000) {
			if (resp) printf("response %02x %02x %02x %02x %02x %02x\n",resp[0],resp[1],resp[2],resp[3],resp[4],resp[5]);
			return -ENODEV;
		}
	} while (1);
	if (highCapacityAllowed) if (resp[4]&0x40) bHighCapacity = 1;
	return 0 ;
}

#ifdef DEBUG
static void print_mmc_csd( struct mmc_csd *csd )
{
   printf( "ecc: %u\n", csd->ecc );
   printf( "file_format: %u\n", csd->file_format );
   printf( "tmp_write_protect: %u\n", csd->tmp_write_protect );
   printf( "perm_write_protect: %u\n", csd->perm_write_protect );
   printf( "copy: %u\n", csd->copy );
   printf( "file_format_grp: %u\n", csd->file_format_grp );
	printf( "content_prot_app: %u\n", csd->content_prot_app );
   printf( "rsvd3: %u\n", csd->rsvd3 );
   printf( "write_bl_partial: %u\n", csd->write_bl_partial );
   printf( "write_bl_len: %u\n", csd->write_bl_len );
   printf( "r2w_factor: %u\n", csd->r2w_factor );
   printf( "default_ecc: %u\n", csd->default_ecc );
   printf( "wp_grp_enable: %u\n", csd->wp_grp_enable );
   printf( "wp_grp_size: %u\n", csd->wp_grp_size );
   printf( "erase_grp_mult: %u\n", csd->erase_grp_mult );
   printf( "erase_grp_size: %u\n", csd->erase_grp_size );
   printf( "c_size_mult1: %u\n", csd->c_size_mult1 );
   printf( "vdd_w_curr_max: %u\n", csd->vdd_w_curr_max );
   printf( "vdd_w_curr_min: %u\n", csd->vdd_w_curr_min );
   printf( "vdd_r_curr_max: %u\n", csd->vdd_r_curr_max );
   printf( "vdd_r_curr_min: %u\n", csd->vdd_r_curr_min );
   printf( "c_size: %u\n", csd->c_size );
   printf( "rsvd2: %u\n", csd->rsvd2 );
   printf( "dsr_imp: %u\n", csd->dsr_imp );
   printf( "read_blk_misalign: %u\n", csd->read_blk_misalign );
   printf( "write_blk_misalign: %u\n", csd->write_blk_misalign );
   printf( "read_bl_partial: %u\n", csd->read_bl_partial );
   printf( "read_bl_len: %u\n", csd->read_bl_len );
   printf( "ccc: %u\n", csd->ccc );
   printf( "tran_speed %u\n", csd->tran_speed );
   printf( "nsac; %u\n", csd->nsac );
	printf( "taac; %u\n", csd->taac );
   printf( "rsvd1: %u\n", csd->rsvd1 );
   printf( "spec_vers: %u\n", csd->spec_vers );
   printf( "csd_structure: %u\n",  csd->csd_structure );
}
#endif 

#define DOS_PART_MAGIC_OFFSET	0x1fe
#define DOS_FS_TYPE_OFFSET	0x36
#define MSDOS_LABEL_MAGIC1	0x55
#define MSDOS_LABEL_MAGIC2	0xAA

struct bpb { // see http://staff.washington.edu/dittrich/misc/fatgen103.pdf
   unsigned char  jump[3];				//0x00
   char           oemName[8];			//0x03
   unsigned short bytesPerSector ;		//0x0b
   unsigned char  sectorsPerCluster ;	//0x0d
   unsigned short reservedSectorCount ;	//0x0e
   unsigned char  numFats ;				//0x10
   unsigned short rootEntCount ;		//0x11
   unsigned short totalSec16 ;			//0x13
   unsigned char  media ; 				//0x15 - 0xF8
   unsigned short fatSz16 ; 			//0x16
   unsigned short secPerTrack ;			//0x18
   unsigned short numHeads ;			//0x1a
   unsigned long  hiddenSectors ;		//0x1c
   unsigned long  totalSectors32 ;		//0x20
   unsigned char  driveNum ;			//0x24
   unsigned char  reserved1 ; 			//0x25 0x00
   unsigned char  bootSig ; 			//0x26 0x29 
   unsigned long  volumeId ;			//0x27
   char           volumeLabel[11];
   char           fileSysType[8];
} __attribute__((packed));

#define isprint(__c) (((__c)>=0x20)&&((__c)<=0x7f))

#ifdef DEBUG
static void ShowBpb(uchar* data,int blockNum)
{
	struct bpb const *bootParams = (struct bpb *)data ;
	unsigned j ;
	for ( j = 0 ; j < MMC_BLOCK_SIZE; j++ ) {
		if ( 0 == ( j & 0x0f ) ) printf( "%04x   ", j );
		printf( "%02x ", data[j] );
		if ( 7 == ( j & 7 ) ) printf( "  " );
		if( 0x0f == ( j & 0x0f ) ) {
			unsigned b ;
			for( b = j-15 ; b <= j ; b++ ) {
				uchar c = data[b];
				if( isprint(c) ) printf( "%c", c );
				else printf( "." );
				if( 7 == ( b & 7 ) ) printf( " " );
			}
			printf( "\n" );
		}
	}
	printf( "Invalid MBR at %d\n",blockNum );
	printf( "---> Boot Parameter block\n" );
	printf( "jump %02x %02x %02x\n", bootParams->jump[0],bootParams->jump[1],bootParams->jump[2]);
	printf( "bytesPerSector: %04x\n", bootParams->bytesPerSector );
